public/emacstips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-15 Wed 11:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zotherstupidguy" />
<link href= "css/stylesheet.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="outline-container-org1d894bb" class="outline-2">
<h2 id="org1d894bb"><span class="section-number-2">1</span> Emacs Tips</h2>
<div class="outline-text-2" id="text-1">
<p>
Must read <a href="http://orgmode.org/manual/Working-with-source-code.html#Working-with-source-code">http://orgmode.org/manual/Working-with-source-code.html#Working-with-source-code</a> as it explains literate programming could help me figure out how 
to write code in emacs and export it to external files and vice-versa.  
M- left arrow can make org elements go to sub
Because I am using Evil-mode I can simply paste using P or p, same as vim's <a href="http://vim.wikia.com/wiki/Copy,_cut_and_paste">http://vim.wikia.com/wiki/Copy,_cut_and_paste</a>
</p>
</div>
<div id="outline-container-org2ebb5fe" class="outline-3">
<h3 id="org2ebb5fe"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> find a way to do org-plot</h3>
</div>
</div>
<div id="outline-container-orge4c0a33" class="outline-2">
<h2 id="orge4c0a33"><span class="section-number-2">2</span> Email</h2>
<div class="outline-text-2" id="text-2">
<p>
access all emails from emacs for easy regex search
</p>
</div>
</div>
<div id="outline-container-org5ab8ec7" class="outline-2">
<h2 id="org5ab8ec7"><span class="section-number-2">3</span> IRC <code>[0/1]</code></h2>
<div class="outline-text-2" id="text-3">
<p>
dfdfd
</p>

<p>
access IRC from inside emacs to automatically log all important channels and always search them for answers before going online.
erc works awesome ;) 
</p>
</div>
<div id="outline-container-org870ae84" class="outline-3">
<h3 id="org870ae84"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> </h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>find some nice configruations for erc</li>
<li>Register username/password</li>
<li>log all opened channels automatically everytime emacs starts</li>
<li>back them up automatically somehow.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaebc0ac" class="outline-2">
<h2 id="orgaebc0ac"><span class="section-number-2">4</span> Backup</h2>
<div class="outline-text-2" id="text-4">
<p>
search for an emacs mode that would allow you to backup my files automatically somehow to googledrive/ github/ or server.
I prefer Github, that way I can auto publish everytime I make an edit on the file (maybe a job that runs every hour or so).
</p>

<p>
<a href="https://github.com/ryuslash/git-auto-commit-mode">https://github.com/ryuslash/git-auto-commit-mode</a>
</p>
</div>
</div>
<div id="outline-container-orgcaa2ed0" class="outline-2">
<h2 id="orgcaa2ed0"><span class="section-number-2">5</span> Time Management</h2>
<div class="outline-text-2" id="text-5">
<p>
using ClockWork app, I work only for 10mins to take 5mins break and a rest every 10x3. 
it is like this because to move slowly is better than being depressed and not moving at all.
</p>
</div>
</div>

<div id="outline-container-orgdaa72d8" class="outline-2">
<h2 id="orgdaa72d8"><span class="section-number-2">6</span> LaTex</h2>
</div>
<div id="outline-container-org4fffa59" class="outline-2">
<h2 id="org4fffa59"><span class="section-number-2">7</span> RSS</h2>
<div class="outline-text-2" id="text-7">
<p>
upwork rss jobs and other stuff.
<a href="http://pragmaticemacs.com/category/elfeed/">http://pragmaticemacs.com/category/elfeed/</a>
</p>
</div>
</div>

<div id="outline-container-org67030e9" class="outline-2">
<h2 id="org67030e9"><span class="section-number-2">8</span> Git</h2>
<div class="outline-text-2" id="text-8">
<p>
need to use 'maget
</p>
</div>
</div>

<div id="outline-container-orgc6757bb" class="outline-2">
<h2 id="orgc6757bb"><span class="section-number-2">9</span> Citations <code>[0/1]</code></h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org19982a0" class="outline-3">
<h3 id="org19982a0"><span class="section-number-3">9.1</span> <span class="todo TODO">TODO</span> </h3>
<div class="outline-text-3" id="text-9-1">
<p>
find somthing like org-ref <a href="http://kitchingroup.cheme.cmu.edu/blog/2014/05/13/Using-org-ref-for-citations-and-references/">http://kitchingroup.cheme.cmu.edu/blog/2014/05/13/Using-org-ref-for-citations-and-references/</a> 
this way we can provide citations for the things we have in Sources Directory
</p>


<hr />
</div>
</div>
</div>

<div id="outline-container-org118b6bc" class="outline-2">
<h2 id="org118b6bc"><span class="section-number-2">10</span> Calender</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><a href="http://jameswilliams.be/blog/2016/01/11/Taming-Your-GCal.html">http://jameswilliams.be/blog/2016/01/11/Taming-Your-GCal.html</a></li>
<li><a href="http://cestlaz.github.io/posts/using-emacs-26-gcal/#.WJ48TSFNy00">http://cestlaz.github.io/posts/using-emacs-26-gcal/#.WJ48TSFNy00</a></li>
<li><a href="http://opensourceforu.com/2016/04/master-the-calendar-centering-macros-and-drawing-tools-in-gnu-emacs/">http://opensourceforu.com/2016/04/master-the-calendar-centering-macros-and-drawing-tools-in-gnu-emacs/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zotherstupidguy</p>
<p class="date">Created: 2017-02-15 Wed 11:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
